NextFOAM-2405/tutorials/multiphase/overInterDyMFoam/rigidBodyHull/background/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name oversetPatch;

        patchInfo
        {
            type    overset;
            value   uniform 0;
        }

        constructFrom patches;

        patches (MRF_REGION);
    }
);


// ************************************************************************* //
